int n = int.Parse(Console.ReadLine());
int sum = 0;
for (int i = 0; i <= n; i++)
{
    if((i % 3) == 0)
    {
        sum = sum + i;
    }
}

Console.WriteLine(sum);

//Рефлексия
//От условието знам, че трябва да прочета число, което е цяло, защото искаме да преминем през всички числа от 1 до N вклячително.
//Следователно ще използваме int, защото мога да съхраня цяло число в този тип данни. Целта на задачата е да премина през всички 
//числа от 1 до N, затова ще използвам цикъл, за да не пропусна число, което може да отговаря на критерия за сума. Имам критерий...